import pygame
#
#
pygame.init()
timer = pygame.time.Clock()
pygame.mixer.init()      

screen = pygame.display.set_mode([1200, 600])
song = pygame.mixer.music.load("top secret/her.mp3")
pygame.mixer.music.set_volume(0.2)
pygame.mixer.music.play(-1)

font = pygame.font.Font("Top secret/Comic Sans.ttf", 26)
pygame.display.set_caption("Internet book")

massages = ["                                                     Глава Перша",
            "(Поліна приходить додому, а Віка вже накрила на стіл)",
            "Віка: О Привіт Поліно нарешті ти приїхала!",
            "Поліна: Привіт та просто трохи затрималася у відрядженні",
            "(Віка підходить до Поліни і цілує її в губи)",
            "Поліна: та ну тобі, перестань",
            "Віка: гаразд пішли їсти (Їдять)",
            "Віка: до речі а що ти мені подаруєш на день народження?",
            "Поліна: а так завтра я піду за ним на весь день, пробач що не встигла забрати",
            "Віка: та ні нічого",
            "Поліна: Ти в мене найкраща",
            "Віка: ага",
            "(Уже всі поїли і пішли спати. Наступного дня)",
            "Поліна: з днем народження Віка!",
            "Віка: дякую!",
            "Поліна: гаразд я піду",
            "Віка: так давай (Поліна йде)",
            "Віка: ура можу позвати Сону н. (Вика звонит Соні н)",
            "Віка: альо",
            "Соня н: альо",
            "Віка: привіт приїжджай до мене, сьогодні Поліни не буде",
            "Соня н: скоро буду",
            "(Тим часом у Поліни)",
            "Поліна: ну що ж давай до тебе",
            "Соня т: так давай (Їдуть до соні т)",
            "(Приїжджає до соні т і соня т сідає в машину)",
            "Соня т: привіт",
            "Поліна: привіт як справи (збентежено подивилася на соню т)",
            "Соня т: нормально(теж збентежено подивилася на Поліну)",
            "(Сидять і дивляться один на одного)",
            "(Поліна Різко наблизилася до Соні т і бере її в засос)",
            "(Це було приблизно 2-3 хвилини)",
            "(Полина положила руку на талию и соня т ее отлкнула)",
            "                                            Кінець Першої Глави",
            "                                                 Глава Друга",
            "(Десь у Віки)",
            "Віка: привіт!",
            "Соня н: привіт з днем народження",
            "Віка: дякую. Гаразд проходь я вже стільки страв напихала",
            "Соня н: давай скуштую (Вони зайшли до дому і сіли за стілець)",
            "Віка: ну про що побалакаєм?",
            "Соня н: не знаю",
            "Віка: давай я перша почну",
            "Соня н: давай",
            "Віка: у мене є відчуття, що Поліна мені зраджує.",
            "Соня н: Не мели дурниць, ну може вона не зраджує, це тільки передчуття!",
            "Соня н: не треба судити за ним", 
            "Віка: ти маєш рацію." ,
            "Соня н: ладно давай я уже буду росказивать",
            "Соня н: гаразд, давай я буду розповідати бо ти трошки прешелепкувата",
            "Віка: егеж"
            "(Перехід до Поліни)"
            "Поліна: Ти чого?"
            "Соня т: я я не готова"
            "Поліна: ладно"
            "(І раптом неочікувано з'являється людина, машина і він падає на машину."
            "Поліна і Соня в шоці від цього. Але його друзі прийшли і відтягнули його назад. "
            "Але щось тут не так. Я кажу, щось тут не так. Я КАЖУ, ЩОТАНЕ ТАК."
            "О і раптом вся увага на відому персону)"
            "Всі привіт, це Ілля."
            "Зараз буде мій час."
            "(Ілля йде по дорозі поруч з машинкою. Але раптом до нього підходить Аргон???)"
            "Ілля: привіт"
            "Аргон: привіт, Ілля" 
            "Ілля: як справи?"
            "Аргон: нормально, до речі, уявляєш, скоро вийде 4 глава історії про Аргона"
            "Ілля: так, я знаю"
            "Аргон: це прямо дуже круто"
            "Ілля: так, чекайте" 
            "Кажуть обидва: Чекайте скоро 4 глава історії про Аргона, "
            " коли вона буде готова, ми зробимо сюрприз, так що чекайте." 
            "Ілля: ладно, треба продовжити фанфік" 
            "Аргон: так, пака"
            "Ілля: пака"



             ]

snip = font.render("", True, "white")




counter = 0
speed = 3
active_massage = 0
message = massages[active_massage]
done = False

run = True

while run:
    screen.fill("#84bf98")
    timer.tick(60)
    pygame.draw.rect(screen, "#006633", [0, 300, 1200, 600])
    
    if counter < speed * len(message):
        counter += 1
    elif counter >= speed*len(message):
        done = True

    for event in pygame.event.get():
        if event.type == pygame.QUIT:
            run = False
            pygame.mixer.music.stop

    if event.type == pygame.KEYDOWN:
        if event.key == pygame.K_RETURN and done and active_massage < len(massages) - 1:
            active_massage += 1
            done = False
            message = massages[active_massage]
            counter = 0

    snip = font.render(message[0:counter//speed], True, "#3d5e49")
    screen.blit(snip, (60, 200))


    pygame.display.flip()
pygame.quit()
